read -sv *.v
hierarchy -top fma
proc; opt
techmap; opt
write_verilog fma_netlist.v